{
    "skillsHeading": "Skills/Technologies Used",
    "projectsHeading": "Personal Projects",
    "person":{
        "name": "Luke Chen Shui",
        "email": "chenshuiluke@gmail.com",
        "phoneNumber": "+1(876)325-0880",
        "jobTitle": "Software Engineer",
        "website": "https://lukechenshui.com/",
        "address": "7 Meadowland Drive, Kinston 19"
    },
    "education": {
      "schools": [{
        "name": "The University of Technology, Jamaica",
        "startDate": "2014",
        "endDate": "present",
        "summary": "Bachelor of Science in Computing"
      }]
    },
    "skills":[
      "Java",
      "Android",
      "PHP",
      "Git",
      "MySQL",
      "Semantic UI",
      "Python",
      "C",
      "HTML",
      "CSS",
      "Flask",
      "Nginx",
      "Caddy"
    ],
    "accomplishments": [
        "Team made it to the ACM-ICPC Programming Caribbean National Finals 2015.",
        "Was the only student to complete all three phases of the Calico 2016 project."
    ]
    ,   
    "jobWork":[
    {
      "company": "C&W Business",
      "position": "Pre-Sales Engineer Intern",
      "summary": "Currently working on a team tasked with consolidating the various internal Excel pricing tools into a single, streamlined web application for use internally.",
      "startDate": "February 2017",
      "endDate": "present",
      "highlights": [
        "Working on a team of five to create an important pricing tool that will be used internally when designing solutions for clients",
        "Created a Python script that extracts existing pricing information from Excel worksheets and dumps them into SQL files. These SQL files are then \"sourced\" in the MySQL CLI which will populate the pricing tool's database with the information.",
        "Made large contributions to both the frontend user interface (Semantic UI, vanilla JS and JQuery) and the backend system (Flask) for the pricing tool.",
        "Set up a test server on DigitalOcean that is used for demo presentations to stakeholders in the project by both management and developers."
      ]
    },    
    {
      "company": "Jamaica Money Market Brokers",
      "position": "Contract Developer",
      "startDate": "May, 2015",
      "endDate": "August, 2016",
      "highlights": [
        "Worked on a team of four to create a Laravel server-side app that serves as the backbone for the web and mobile app that are used both internally as well as by customers.",
        "Successfully created the part of the Laravel app that pulls customer information from JMMB's servers via SOAP when necessary, thus preventing the need to have two copies of customer information and reducing the probability of data being compromised."
      ]
    }],
    "volunteerWork":[
    {
      "company": "The Palisadoes Foundation - Calico Project 2016",
      "position": "Project Participant",
      "summary": "The Calico Project is a programme from The Palisadoes Foundation that incentivizes Jamaican youth to contribute to various open source projects.",
      "startDate": "June, 2016",
      "endDate": "August, 2016",
      "highlights": [
        "Developed a code style linter designed to ensure that all committed code adheres to the project style guides."
        ]
    }],
    "projects":[
        {
            "name": "JResume",
            "description": "A Java program that takes a JSON file and converts it to an HTML resume.",
            "highlights": [
                "Among the approved projects for the Calico Project 2017.",
                "Was used to generate this resume!",
                "Allows separation of concerns by allowing you to keep the content of the resume separate from the design of the resume"
            ],
            "url": "https://github.com/chenshuiluke/jresume"            
        },
        {
            "name": "Lightna Framework",
            "description": "A PHP framework used to build web applications.",
            "highlights": [
                "Allows the manipulation of databases without SQL."
            ],
            "url": "https://github.com/chenshuiluke/lightna-framework"            
        },
        {
            "name": "BeatPulse",
            "description": "A music player app for Android.",
            "url": "https://github.com/chenshuiluke/beatpulse"            
        }                       
    ]
}
