{
    "skillsHeading": "Skills/Technologies Used",
    "projectsHeading": "Personal Projects",
    "person":{
        "name": "Luke Chen Shui",
        "email": "chenshuiluke@gmail.com",
        "phoneNumber": "+1(876)325-0880",
        "jobTitle": "Software Engineer",
        "website": "https://lukecs.com/",
        "address": "7 Meadowland Drive, Kingston 19"
    },
    "education": {
      "schools": [{
        "name": "The University of Technology, Jamaica",
        "startDate": "2014",
        "endDate": "present",
        "summary": "Bachelor of Science in Computing"
      }]
    },
    "skills":[
      "Java",
      "Android",
      "PHP",
      "Git",
      "MySQL",
      "Semantic UI",
      "Python",
      "Laravel",
      "HTML",
      "CSS",
      "Flask",
      "Drupal",
      "Rust"
    ],
    "accomplishments": [
        "Team made it to the ACM-ICPC Programming Caribbean National Finals 2015.",
        "Was the only student to complete all three phases of the Calico 2016 project."
    ]
    ,   
    "jobWork":[
    {
      "company": "Advanced Internet Technologies, Inc.",
      "position": "Software Engineer",
      "summary": "Developed a highly performant subscription-based ip geolocation web system capable of serving thousands of simultaneous users.",
      "startDate": "January 2017",
      "endDate": "present",
      "highlights": [
        "Wrote the code responsible for retrieving geolocation information for a specified IP address.",
        "Implemented API rate limiting to prevent users from exceeding the limits stipulated by their subscription plan.",
        "Created the landing page which shows the location of the user visiting it.",
        "Created the user account details page, where the user can change his password, upgrade his subscription and see his current API usage.",
        "Created API documentation page and added API usage examples for Java, PHP, Python, cURL and JavaScript.",
        "Ported the initial version of the website from an in-house PHP framework to Laravel 5.4."
      ]
    }, 

    {
      "company": "Niageo Technologies",
      "position": "Web Developer Intern",
      "summary": "Currently tasked with developing and maintaining Drupal websites for the company's business clients.",
      "startDate": "June 2017",
      "endDate": "present"
    },              
    {
      "company": "C&W Business",
      "position": "Pre-Sales Engineer Intern",
      "summary": "Worked on a team of five tasked with consolidating the various internal Excel pricing tools into a single, streamlined web application for use internally when developing solutions for business clients.",
      "startDate": "February 2017",
      "endDate": "June 2017",
      "highlights": [
        "Created a Python script that extracts existing pricing information from the Excel pricing worksheets and dumps them into SQL files. These SQL files are then \"sourced\" in the MySQL CLI which will populate the pricing tool's database with the information. This was an essential part of getting the project off the ground due to the fact that we would otherwise have needed to entered several thousands of records into the database manually.",
        "Added the ability for the webapp to automatically generate an Excel quote based on the user's selections.",
        "Set up a test server on DigitalOcean that is used for demo presentations to stakeholders in the project by both management and developers.",
        "Added equipment, services, support, provider and provider CRUD functionality, which dramatically improved team efficiency and made it infinitely easier for the internal users to add products to list of offerings."
      ]
    }],
    "projects":[
        {
            "name": "JResume",
            "description": "A Java program that takes a JSON file and converts it to an HTML resume.",
            "highlights": [
                "Among the approved projects for the Calico Project 2017.",
                "Was used to generate this resume!",
                "Allows separation of concerns by allowing you to keep the content of the resume separate from the design of the resume. Which makes it easier to completely change the layout of the resume when changing themes."
            ],
            "url": "https://github.com/chenshuiluke/jresume"            
        },
        {
            "name": "JResume-Web",
            "description": "A frontend for JResume written in React.",
            "url": "https://github.com/chenshuiluke/jresume-web",
            "highlights": [
              "A frontend that is being written for JResume to allow less technical people to benefit from its features",
              "Converts the form data to JSON and sends it to a JResume instance that is running in server mode. It then serves the resulting web resume to the user."
            ]
        }, 
        {
            "name": "github-repo-dl",
            "description": "A simple Rust CLI program that makes it easy to backup all your github repositories.",
            "url": "https://github.com/chenshuiluke/github-repo-dl",
            "highlights": [
              "Once provided with the user's GitHub personal access token, it can download all of the user's repositories to a local folder."
            ]
        },
        {
          "name": "JADE Mobile App",
          "url": "https://github.com/JADE-Limited/JADE-Mobile-App",
          "description": "Developed as a volunteer for the Jamaican Association for Debating and Empowerment, the JADE Mobile App is a work-in-progress question & answer platform designed to increase the level of discourse for topics relevant to the Jamaican society.",
          "highlights": [
            "Allows users to ask and answer questions as well as comment on and upvote answers.",
            "In addition to that, users can specifically request answers from experts listed in the app. The expert will get a notification that shows that their expertise has been requested",
            "An administrative backend was also created that allows JADE management to moderate the content on the platform and to add or remove experts from the list."
          ]
        }                            
    ]
}
